app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-11-04 12:58:18.176729"], ["updated_at", "2018-11-04 12:58:18.176729"]]
---
  def create
    @school_class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
    # @school_class = SchoolClass.create(title: params[:title],room_number: params[:room_number])
    @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    # you have the id
    @school_class = SchoolClass.find_by(id: params[:id])