app/controllers/students_controller.rb

  def create
    # @student = Student.new((params.require(:student).permit(:first_name, :last_name
    @student = Student.create(params.require(:student).permit(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Alex"], ["last_name", "Frosell"], ["created_at", "2018-11-02 19:45:33.546233"], ["updated_at", "2018-11-02 19:45:33.546233"]]

  def update
    @student = Student.find_by(id: params[:id])
    # @student = Student.find(params[:id])
    @student.update(params.require(:student).permit(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-11-04 13:53:47.140581"], ["id", 1]]